/// CTRL + SHIFT + N - Създаване на нов ПРАЗЕН файл
/// CTRL + S - Запазва файла
/// CTRL + O - Отваря файл
/// F9 - пускане на програмата
#include<iostream>
using namespace std;
int main()
{
    //
    ///
    /*
    cout<<"Hello, World!";
    cout<<"Добър ден!"<<endl; /// Без кирилица
    */
    /*
    int - цяло число
    double - дес. дроб
    float - дес. дроб с по-малко знаци след дес. запетайка
    char - символ
    bool - истина/лъжа
    */

//    int a, b;
//    cin>>a; /// Въвеждаме от клавиатурата
//    cin>>b;
//    cin>>a>>b;
//    cout<<a<<endl<<b<<endl; /// Извеждаме на екрана

    /// +, -, *, /, %
    /// a == b -> Дали а е равно на б?
    /// a != b -> Дали а НЕ е равно на б?
    /// а > b -> Дали а е по-голямо от б?
    /// a >= b -> Дали а е по-голямо или равно на б?
    /// a < b -> Дали а е по-малко от б>
    /// a <= b -> Дали а е по-малко или равно на б?
    /// !a -> Отрицанието на а (а трябва да е истина или лъжа)
    /// a && b -> а И b
    /// а || b -> a ИЛИ b

    double a, b;
//    double a;
//    double b;
    cin>>a>>b;
//    cout<<a / double(b);
    cout<<int(a) / b<<endl;

    char c; ///= 'A';
    cin>>c;
    cout<<c<<endl;

    bool d = true; /// false
//    cin>>d;
    cout<<d;

    return 0;
}
